<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7298fcd24f5c52afb23172d33b326e8718b3d3ccd0bedca71f3879ba2d5edf0b","plan_job_ref":"Job Test plan target and replace #405 at https://github.com/dflook/terraform-github-actions/actions/runs/7555582505","plan_out_hash":"92658abee54648ed0c1738b0857f03f597b374cf414ce0d2b0396142010f09e0","plan_hash":"28ddcdf4db5d432912a979e0aa713e1bbe50ea31b9921c24e1400128a99960d6","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "r9x85zuZE4" -> (known after apply)
!~  foreach = "ZBaiIt5Ucm" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #405](https://github.com/dflook/terraform-github-actions/actions/runs/7555582505)